# GetLocalCoordinateSystem Method (XYZ) (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelStick..::..GetLocalCoordinateSystem Method (XYZ)
AnalyticalModelStick Class See Also
---
Gets the local coordinate system (LCS) reflects analytical model orientation at the specified point.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2015
# Syntax
C#
---
```text
public Transform GetLocalCoordinateSystem(
	XYZ point
)
```

Visual Basic
---
```text
Public Function GetLocalCoordinateSystem ( _
	point As XYZ _
) As Transform
```

Visual C++
---
```text
public:
Transform^ GetLocalCoordinateSystem(
	XYZ^ point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB..::..XYZ The point on the analytical model stick element.
# ### Return Value
Transformation matrix.
  * x - longitudinal axis,
  * y - transversal, section - horizontal, strong axis,
  * z - transversal, section - vertical, weak axis,
  * origin - base point of LCS.

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The point does not lie on the element. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalModelStick Class
GetLocalCoordinateSystem Overload
Autodesk.Revit.DB.Structure Namespace